# CircuitNamingIndex Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSystem..::..CircuitNamingIndex Property
ElectricalSystem Class See Also
---
The Circuit Naming Index where the Electrical System is located in its panel. The Circuit Naming Index is used to retrieve the Circuit Naming Index of the Electrical System.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public int CircuitNamingIndex { get; }
```

Visual Basic
---
```text
Public ReadOnly Property CircuitNamingIndex As Integer
	Get
```

Visual C++
---
```text
public:
property int CircuitNamingIndex {
	int get ();
}
```

# See Also
ElectricalSystem Class
Autodesk.Revit.DB.Electrical Namespace